# JSON in Python

In [9]:
import json
import pandas as pd

with open('practice_json.json', 'r') as f:
    json_data = json.load(f)

print(type(json_data)) # list of dictionaries
print(json_data[0])

<class 'list'>
{'id': 1, 'name': 'Alice', 'age': 28, 'city': 'London', 'skills': ['Python', 'SQL', 'Excel']}

In [3]:
json_data

[{'id': 1,
  'name': 'Alice',
  'age': 28,
  'city': 'London',
  'skills': ['Python', 'SQL', 'Excel']},
 {'id': 2,
  'name': 'Bob',
  'age': 34,
  'city': 'Tel Aviv',
  'skills': ['JavaScript', 'React']},
 {'id': 3,
  'name': 'Charlie',
  'age': 25,
  'city': 'New York',
  'skills': ['Python', 'Data Analysis']}]

In [11]:
df = pd.DataFrame(json_data)
df

   id     name  age      city                   skills
0   1    Alice   28    London     [Python, SQL, Excel]
1   2      Bob   34  Tel Aviv      [JavaScript, React]
2   3  Charlie   25  New York  [Python, Data Analysis]

## Explode the skills column (values are lists)

In [13]:
df_exploded = df.explode('skills')
df_exploded

   id     name  age      city         skills
0   1    Alice   28    London         Python
0   1    Alice   28    London            SQL
0   1    Alice   28    London          Excel
1   2      Bob   34  Tel Aviv     JavaScript
1   2      Bob   34  Tel Aviv          React
2   3  Charlie   25  New York         Python
2   3  Charlie   25  New York  Data Analysis

In [21]:
total_python = len(df_exploded.loc[df_exploded['skills']=='Python', :])
total_python

2

In [24]:
json_data.append({'id':4, 'name':'Sam', 'city':'Manchester', 'skills': ['Python', 'SQL', 'Grafana']})
json_data

[{'id': 1,
  'name': 'Alice',
  'age': 28,
  'city': 'London',
  'skills': ['Python', 'SQL', 'Excel']},
 {'id': 2,
  'name': 'Bob',
  'age': 34,
  'city': 'Tel Aviv',
  'skills': ['JavaScript', 'React']},
 {'id': 3,
  'name': 'Charlie',
  'age': 25,
  'city': 'New York',
  'skills': ['Python', 'Data Analysis']},
 {'id': 4,
  'name': 'Sam',
  'city': 'Manchester',
  'skills': ['Python', 'SQL', 'Grafana']},
 {'id': 4,
  'name': 'Sam',
  'city': 'Manchester',
  'skills': ['Python', 'SQL', 'Grafana']}]

# Write a json file

In [30]:
# 1 convert df and save
df.to_json('new_json.json', orient='records', indent=2)

# 2 write json to file
with open('other_json.json', 'w') as jf:
    json.dump(json_data, jf, indent=2)

In [2]:
import json

with open('practice_json.json', 'r') as f:
    data = json.load(f)
data

[{'id': 1,
  'name': 'Alice',
  'age': 28,
  'city': 'London',
  'skills': ['Python', 'SQL', 'Excel']},
 {'id': 2,
  'name': 'Bob',
  'age': 34,
  'city': 'Tel Aviv',
  'skills': ['JavaScript', 'React']},
 {'id': 3,
  'name': 'Charlie',
  'age': 25,
  'city': 'New York',
  'skills': ['Python', 'Data Analysis']}]

In [5]:
import pandas as pd
df = pd.DataFrame(data)
df['skills'].explode()

0           Python
0              SQL
0            Excel
1       JavaScript
1            React
2           Python
2    Data Analysis
Name: skills, dtype: object

In [ ]:
df.to_json(